nsynet/electronics_books/0232、例说STM32 ALIENTEK MINISTM32 实验27例光盘资料/标准例程/ALIENTEK MINISTM32 实验21 红外遥控实验(库)/App/main.c
/**********************************************
File Name: ALIENTEK MINISTM32 实验21 红外遥控实验(库)
Revision:
Corporation:
Microcontroller Corporation:ST
Microcontroller name:STM32F103RBT6 ARM
Compiler: Keil MDK_ARM 4.11
Author: moweidong
E-mail: moweidongsabbit@21cn.com
Date : 2010.12.05
*********************************************/
//仿真仪器设备:
//ALIENTEK_MiniSTM32_REVB0开发板
//JLINK V7
/*********************************************
//库
//CMSIS:V1.20
//STM32F10x_StdPeriph_Driver:V3.1.1
*********************************************/

//本程序使用了printf用于在LCD和串口显示数据,因些对Option for Target属性有如下更改
//Target选项页:勾中Use MicroLIB(使用微库)

//LED0:PA8
//LED1:PD2

//PA1:接上短路块
//修正原子的LSB和MSB弄错的问题

//注意:在禁用JTAG接后后可这样恢复:
//1.设置KEIL为JTAG或SW下载模式
//2.给板上电,按下板上的复位按键不放,点击KEIL下的FLASH下载按钮,使JTAG或SW下载工具检测完成接口后立刻放开,
//此目的在于争取IC在上电的时候有控制权,使在未进入禁用JTAG或SW生效的时候取可控制IC进行烧录

//使用JLINK JTAG下载的请在下载完成后拔走JLINK

#include "stm32f10x.h"
#include "LCD.h"
//#include "USART.h"
#include "eval.h"
#include "SysTickDelay.h"
#include "UART_INTERFACE.h"
#include "remote.h"
#include <stdio.h>



/* Private typedef -----------------------------------------------------------*/
typedef enum { FAILED = 0, PASSED = !FAILED} TestStatus;

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);



void GPIO_Configuration(void)
	{
	//GPIO_InitTypeDef GPIO_InitStructure;
				
	/* Configure USART1 Tx (PA.09) as alternate function push-pull */
	//GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	//GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	//GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	/* Configure USART1 Rx (PA.10) as input floating */
	//GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	//GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	//GPIO_Init(GPIOA, &GPIO_InitStructure);#ifdef USE_STM3210C_EVAL

	/* Initialize LEDs and Key Button mounted on STM3210X-EVAL board */       
	STM_EVAL_LEDInit(LED1);
	STM_EVAL_LEDInit(LED2);
	}

//系统中断管理
void NVIC_Configuration(void)
	{ 
	//NVIC_InitTypeDef NVIC_InitStructure;

	/* Configure the NVIC Preemption Priority Bits */  
	//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0);	//设置优先级分组：先占优先级0位,从优先级4位
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);	//设置优先级分组：先占优先级2位,从优先级2位
	
	//设置向量表的位置和偏移
	#ifdef  VECT_TAB_RAM  
		/* Set the Vector Table base location at 0x20000000 */ 
		NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 		//向量表位于RAM
	#else  /* VECT_TAB_FLASH  */
		/* Set the Vector Table base location at 0x08000000 */ 
		NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);   //向量表位于FLASH
	#endif
	}

//配置系统时钟,使能各外设时钟
void RCC_Configuration(void)
	{
	SystemInit();	
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA 
	//	|RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC
	//	|RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE
	//	|RCC_APB2Periph_ADC1  | RCC_APB2Periph_AFIO 
	//	|RCC_APB2Periph_SPI1, ENABLE );
	// RCC_APB2PeriphClockCmd(RCC_APB2Periph_ALL ,ENABLE );
	//RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4 
	//	|RCC_APB1Periph_USART3|RCC_APB1Periph_TIM2	                           
	//	, ENABLE );
	}
	






//配置所有外设
void Init_All_Periph(void)
	{
	
	RCC_Configuration();	
	
	NVIC_Configuration();

	GPIO_Configuration();
	
	//USART1_Configuration();
	USART_Configuration(9600);
	

	}









void Delay(vu32 nCount)
	{
	for(; nCount != 0; nCount--);
	}

/**
  * @brief  Inserts a delay time.
  * @param  nTime: specifies the delay time length, in milliseconds.
  * @retval None
  */
//void Delay(__IO uint32_t nCount)
//	{
//	for(; nCount != 0; nCount--);
//	}



int main(void)
	{  
	u8 key;
	u8 t;
	Init_All_Periph();
	SysTick_Initaize();

	LCD_Init();			//初始化液晶	 	  
	Remote_Init();	    //初始化红外接收
		   
	POINT_COLOR=RED;//设置字体为红色	   
	LCD_ShowString(60,50,"Mini STM32");	
	LCD_ShowString(60,70,"REMOTE TEST");	
	LCD_ShowString(60,90,"ATOM@ALIENTEK");
	LCD_ShowString(60,110,"2010/6/17");
	 
	LCD_ShowString(30,130, "KEYVAL:");
	LCD_ShowString(130,130,"KEYCNT:");	  
	LCD_ShowString(30,150, "SYMBOL:");
	while(1)
		{	  
		if(Remote_Rdy)
			{
			key=Remote_Process();
			LCD_ShowNum(86,130,key,3,16);//显示键值
			LCD_ShowNum(186,130,Remote_Cnt,3,16);//显示按键次数
			switch(key)
				{
				case 0:
					LCD_ShowString(86,150, "ERROR");  
					break;
				case 0x45:
					LCD_ShowString(86,150, "POWER ");
					break;
				case 0x46:
					LCD_ShowString(86,150, "CH+   ");
					break;
				case 0x40:
					LCD_ShowString(86,150, "STOP  ");
					break;
				case 0x47:
					LCD_ShowString(86,150, "ZOOM  "); 
					break;
				case 0x43:
					LCD_ShowString(86,150, "REC   "); 
					break;
				case 0x44:
					LCD_ShowString(86,150, "RECALL");
					break;
				case 0x1C:
					LCD_ShowString(86,150, "8     ");
					break;
				case 0x07:
					LCD_ShowString(86,150, "VOL-  ");
					break;
				case 0x15:
					LCD_ShowString(86,150, "CH-   ");
					break;
				case 0x09:
					LCD_ShowString(86,150, "VOL+  "); 
					break;
				case 0x16:
					LCD_ShowString(86,150, "1     "); 
					break;
				case 0x19:
					LCD_ShowString(86,150, "2     "); 
					break;
				case 0x0D:
					LCD_ShowString(86,150, "3     "); 
					break;
				case 0x0C:
					LCD_ShowString(86,150, "4     "); 
					break;
				case 0x18:
					LCD_ShowString(86,150, "5     ");
					break;
				case 0x5E:
					LCD_ShowString(86,150, "6     ");
					break;
				case 0x08:
					LCD_ShowString(86,150, "7     ");
					break;
				case 0x5A:
					LCD_ShowString(86,150, "9     ");
					break;
				case 0x42:
					LCD_ShowString(86,150, "0     ");  
					break;
				case 0x4A:
					LCD_ShowString(86,150, "TSHIFT");	//上档位键
					break;
				}
			}
		else delay_ms(2);
		t++;
		if(t==200)
			{
			t=0;
			STM_EVAL_LEDToggle(LED1);
			}
		}
	
	}





#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif





